tsung-tests/AddVolunteerStaticOnly.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="targetmachine" port="80" type="tcp"></server>
</servers>

  <monitoring>
    <monitor host="targetmachine" type="snmp"></monitor>
  </monitoring>

 <load duration="62" unit="minute">
   <arrivalphase phase="1" duration="1" unit="minute">
     <users maxnumber="25" arrivalrate="1" unit="second"></users>
   </arrivalphase>
    <arrivalphase phase="2" duration="3" unit="minute">
     <users maxnumber="50" arrivalrate="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="3" duration="6" unit="minute">
     <users maxnumber="100" arrivalrate="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="4" duration="12" unit="minute">
     <users maxnumber="200" arrivalrate="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="36" unit="minute">
     <users maxnumber="400" arrivalrate="2" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
     <option name="file_server" id='newvolunteers' value="volunteers.csv"/>
     <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>
  


<sessions>
<session name='add-volunteer' probability='100'  type='ts_http'>

<request><http url='http://targetmachine/eden/static/themes/IFRC/ext-theme.min.css' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/eden.min.css' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/jquery-1.7.2.min.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/ext/adapter/jquery/ext-jquery-adapter.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/ext/ext-all.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/ext/src/locale/ext-lang-en_GB.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/S3/S3.min.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/dummy_flag.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_staff.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_volunteers.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_warehouse.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_members.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_assets.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_assessments.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_tools.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/sahanasmall_05.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/logo.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/news_window_bg.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/map_bg.jpg' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/header_shadow.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/map_marker.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/maptip_start.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/dashboard_shadow.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/maptip_end.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/jquery.cluetip/wait.gif' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/colorbox/border.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:54 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/colorbox/controls.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:54 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/colorbox/loading_background.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:54 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/jquery-ui/ui-anim_basic_16x16.gif' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>


<request><http url='/eden/static/img/dialog-confirmation.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:54 GMT' method='GET'></http></request>


<request><http url='/eden/static/img/ajax-loader.gif' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:54 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/yepnope.1.5.4-min.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_staff_wide.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/graphic_catalogue.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/S3/s3.select_person.min.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/S3/s3.locationselector.widget.min.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/S3/s3.dataTables.min.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/sidenav_tab.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/gis/GeoExt.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/gis/OpenLayers.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/scripts/S3/s3.gis.min.js' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/bullet-triangle.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:56 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/jquery-ui/calendar.gif' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/jquery-ui/ui-bg_highlight-soft_100_eeeeee_1x100.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>

<request><http url='/eden/static/img/gis/openlayers/layer-switcher-minimize.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/ext/qtip/tip-sprite.gif' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/themes/IFRC/img/ext/qtip/tip-anchor-sprite.gif' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:57 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/gis/openlayers/layer-switcher-maximize.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>


<request><http url='/eden/static/img/help_off.gif' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/jquery-ui/ui-icons_222222_256x240.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>


<request><http url='/eden/static/img/jquery-ui/ui-bg_glass_100_fdf5ce_1x400.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>


<request><http url='/eden/static/img/jquery-ui/ui-bg_gloss-wave_35_f6a828_500x100.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/jquery-ui/ui-icons_ffffff_256x240.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>
<request><http url='/eden/static/img/jquery-ui/ui-bg_glass_100_f6f6f6_1x400.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>

<request><http url='/eden/static/img/jquery-ui/ui-bg_highlight-soft_75_ffe45c_1x100.png' version='1.1' if_modified_since='Fri, 14 Sep 2012 15:58:55 GMT' method='GET'></http></request>


</session>

</sessions>
</tsung>