tsung-tests/login.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="localhost" port="8000" type="tcp"></server>
</servers>

 <load duration="1" unit="minute">
   <arrivalphase phase="1" duration="1" unit="minute">
     <users maxnumber="100" arrivalrate="5" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>


<sessions>
<session name='Login' probability='100'  type='ts_http'>

<request><http url='http://localhost:8000/eden/' version='1.1' method='GET'></http></request> <!-- Change the URL here -->

<!-- Visit Login page -->
        <request>
            <!-- Collect the formkey from the registration form (not the sign-in form!) -->
            <dyn_variable name="_formkey" xpath="//input[@name='_fromkey'][1]/@value" />
            <http url="/eden/default/user/login" method="GET" version="1.1"></http>
        </request>
        <request subst="true">  <!-- Hard coded to login as admin@example.com -->
            <http url="/eden/default/user/login" method="POST" version="1.1" content_type='application/x-www-form-urlencoded' contents="_formname=login&amp;_formkey=%%__formkey%%&amp;email=admin@example.com&amp;password=testing&amp;_next=/eden/default/index&amp;_utc_offset=-330">
            </http>
        </request>


</session>
  </sessions>
</tsung>