tsung-tests/test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="targetmachine" port="80" type="tcp"></server>
</servers>

 <load duration="1" unit="minute">
   <arrivalphase phase="1" duration="1" unit="minute">
     <users maxnumber="1" arrivalrate="1" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>


<sessions>
  <session name='Login_Check' probability='100'  type='ts_http'>

<request>        <http url='http://targetmachine/eden/' version='1.1' method='GET'></http></request> <!-- Change the URL here -->
	<!-- Visit Registration page -->
        <request>
            <!-- Collect the formkey from the registration form (not the sign-in form!) -->
            <dyn_variable name="_formkey" xpath="/html/body/div[3]/div[2]/div/div[2]/div/form/div/input[2]/@value" />
            <http url="/eden/default/user/login" method="GET" version="1.1"></http>
        </request>
        <request subst="true">  <!-- Hard coded to login as test@example.com -->
            <http url="/eden/default/user/login" method="POST" version="1.1" content_type='application/x-www-form-urlencoded' contents="_formname=login&amp;_formkey=%%__formkey%%&amp;email=test@example.com&amp;password=eden&amp;_next=/eden/default/index&amp;_utc_offset=-330">
            </http>
        </request>

        <request><http url='eden/default/user/profile' version='1.1' method='GET'></http></request>

  </session>

</sessions>

</tsung>